{
    "jobs": [
        {
            "facility": "American River Psychiatric Health Facility",
            "jobTitle": "Dietary Services (Director)",
            "summary": "Under supervision of the administrator, the director of dietary/culinary services directs and coordinates all aspects of the dietary/culinary services department. The director ensures compliance with established policies and procedures as well as state-mandated standards for dietary/culinary services. The director of dietary/culinary services consults with the dietitian consultant as appropriate to ensure that all clients’ nutritional needs are consistently met.",
            "status": "Full Time",
            "shift":"AM",
            "classification":"Non-Exempt",
            "details": [
                {
                    "title":"POSITION QUALIFICATIONS",
                    "description": null,
                    "list": [
                        "Must possess a high school diploma or equivalent.",
                        "Must have completed a 90-hour state-approved course in dietetic services, if required by regulatory agency management, or must complete in one (1) year.",
                        "Must have a minimum of one year of dietary/culinary and supervisory experience in an extended care facility.",
                        "Must possess the ability to interact in a courteous and professional manner with all staff, clients, and visitors.",
                        "Must possess the ability to respond correctly and professionally to inquiries of state surveyors, local health department evaluators, etc."
                    ]
                },
                {
                    "title":"POSITION RESPONSIBILITIES",
                    "description":"",
                    "list":[
                        "Is responsible for the total operation of dietetic services.",
                        "Maintains adequate supply of food items and costs thereof..",
                        "Properly orients, supervises, instructs, evaluates, terminates, and hires as appropriate to the dietary/culinary services staff.",
                        "Prepares and posts dietary/culinary staff work/task schedules.",
                        "Makes recommendations as to the quality, quantity, and variety of foods, dietary/culinary supplies, and equipment purchased.",
                        "Supervises and assists with receiving and storage of food items and supplies.",
                        "Supervises and assists with preparation and serving as necessary.",
                        "Supervises and assists with sanitation procedures in all areas of dietary/culinary services.",
                        "Interviews and assesses clients as to their food preferences and documents for food preparation purposes.",
                        "Observes meals being served and performs mealtime rounds to assess quality of food client satisfaction.",
                        "Attends facility meetings as appropriate.",
                        "Presents formal and informal dietary/culinary staff training as necessary.",
                        "Participates in the formulation of menus, pertinent personnel policies, job descriptions, and other dietary/culinary services policies and procedures.",
                        "Maintains proper levels of sanitation as per health department code.",
                        "Posts menus one week in advance.",
                        "Consults with the director of nurses and/or charge nurses regarding client dietary/culinary needs, food intake, weights, and other pertinent information.",
                        "Coordinates with the activity director as to special occasions, holiday celebrations, client birthdays, etc.",
                        "Manages the department within allocated/budgeted parameters.",
                        "Works with clients in training capacity, if applicable.",
                        "Other duties as assigned."
                    ]
                },
                {
                    "title":"PHYSICAL DEMANDS",
                    "description":"",
                    "list":[
                        "Must be able to sit or stand for extended periods of time in a minimum eight (8) hour day for two- to three-hour increments.",
                        "Must have physical and cognitive ability to assist in an emergency situation such as pushing a wheelchair or bed, or appropriately intervening with clients who may physically and/or verbally act out.",
                        "Must be able to lift at least 25 pounds.",
                        "Crestwood Behavioral Health, Inc. is an EEO/AA/Minority/F/Vet/Disability Employer. All qualified applicants will receive consideration for employment without regard to their protected veteran status and will not be discriminated against on the basis of disability."
                    ]
                }
            ]
        },
        {
            "facility": "Crestwood Bakersfield Behavioral Health Center",
            "jobTitle": "Recovery Coach",
            "summary": "Under the supervision of the Director of Nursing and the Program Director, the Recovery Coach (Entry Level Mental Health Worker) is responsible for assisting in the provision of the therapeutic milieu by monitoring and communicating with clients, providing rehabilitation groups under supervision, and assisting in crisis intervention. Other duties for the Recovery Coach (Entry Level Mental Health Worker) may be assigned as needed by the Director of Nursing, the Program Director, or a Designee.             The Recovery Coach (Entry Level Mental Health Worker) is a critical part of the team ensure proper care over our clients. Many Recovery Coach (Entry Level Mental Health Worker) go on to be promoted to Service Coordinator roles.",
            "status": "On Call",
            "shift": "Flex",
            "classification":null,
            "details": [
                {
                    "title":"POSITION QUALIFICATIONS",
                    "description":"",
                    "list":
                    [
                        "Minimum of a high school diploma/GED.",
                        "A valid California driver’s license preferred.",
                        "Minimum of two years clinical experience as applicable in a psychiatric setting.",
                        "In the absence of two years experience, training may be substituted. This training will be based on, but not limited to, the in-service plan for 52 hours.",
                        "Driving duties may be assigned, including the transportation of clients. Candidates must have a valid CA Drivers License and successfully pass a DMV driving history check."
                    ]
                },
                {
                    "title":"Crestwood Offers Comprehensive Benefit Packages (for full-time employees)",
                    "description":"",
                    "list":[
                        "Medical, Dental, and Vision Coverage (including dependents and domestic partners)",
                        "Life Insurance",
                        "Vacation",
                        "Mental Health Days",
                        "Paid Sick Leave",
                        "401k retirement",
                        "Scholarship program",
                        "Pay-in-Lieu of Benefits (optional)",
                        "Paid Holidays",
                        "Service Awards",
                        "Jury Duty Pay"
                    ]
                }
            ]
        },
        {
            "facility":"Crestwood Crisis Stabilization Services- Fairfield",
            "jobTitle":"Housekeeper",
            "summary":"Crestwood Behavioral Health Inc . is proud to be California’s leading provider of mental health services, assisting thousands of clients from across the state. Our focus is on creating strong relationships with counties in which we both have a financial commitment, providing the services which are tailored to meet our clients’ specific needs, and reinforcing a common set of values that guide our practices and policies. Under the direction of the Director of Plant/Environmental Services, or Designee, the Housekeeper/Janitor is responsible for assisting with the overall functions of the housekeeping department. The Housekeeper/Janitor maintains the facility in a clean and safe environment for clients, staff, and visitors.",
            "status":"Part Time",
            "shift":"AM",
            "classification":"Non-Exempt",
            "details": [
                {
                    "title": "POSITION QUALIFICATIONS",
                    "description":"",
                    "list":[
                        "A high school diploma/GED preferred.",
                        "One year experience as a housekeeper in a long-term care facility or hospital preferred.",
                        "Knowledge of cleaning, disinfection, and sterilization techniques is mandatory."
                ]
                },
                {
                    "title":"POSITION RESPONSIBILITIES",
                    "description":"",
                    "list":[
                        "Cleans clients’ rooms, bathrooms, public areas, and offices (which entail a lot of squatting, bending, and reaching).",
                        "Cleans and mops floors; must be able to mop with mops weighing approximately twenty-four (24) ounces, if applicable.",
                        "Dusts furniture, light fixtures, lamps, window ledges, and equipment. Use furniture polish on furniture once per week.",
                        "Empties and changes liners in all waste cans daily or when needed.",
                        "Cleans and washes all basins, commodes, lavatories, and fixtures.",
                        "Restocks supplies of paper towels, soap, etc.",
                        "Spot cleans all walls.",
                        "Checks vacant rooms daily to keep fresh and keep furniture straight.",
                        "Picks up bottles, papers, etc., from floors and puts in proper place.",
                        "Completes repair requisitions when needed.",
                        "Obeys all safety rules.",
                        "Follows cleaning schedule.",
                        "Attends in-service training classes.",
                        "Does the necessary buffing of facility floors.",
                        "Works with clients in training capacity, if applicable.",
                        "All other duties as assigned."
                    ]
                }
            ]
        }
    ]
}